КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_СценарииРедактированияШаблона/КонтурЛогистика_СценарииРедактированияШаблона.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_СценарииРедактированияШаблона</name>
  <enumValues>
    <name>НеРедактируется</name>
    <comment>Шаблон для подписания</comment>
  </enumValues>
  <enumValues>
    <name>ДоступныВсеПоля</name>
    <comment>Документ, созданный из данного шаблона, контрагент сможет  отредактировать - внести дополнения по грузу, адресам или иным данным.</comment>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_ТипыЛогистическихДокументов/КонтурЛогистика_ТипыЛогистическихДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_ТипыЛогистическихДокументов</name>
  <enumValues>
    <name>ТрН_Титул1</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул2</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул3</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул4</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул5</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул6</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул7</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул8</name>
  </enumValues>
  <enumValues>
    <name>ЗН_Титул1</name>
  </enumValues>
  <enumValues>
    <name>ЗН_Титул2</name>
  </enumValues>
  <enumValues>
    <name>ЗН_Титул3</name>
  </enumValues>
  <enumValues>
    <name>ЗН_Титул4</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул1</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул2</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул3</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул4</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул5</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул6</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул7</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул8</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул9</name>
  </enumValues>
  <enumValues>
    <name>ЗЗ_Титул1</name>
  </enumValues>
  <enumValues>
    <name>ЗЗ_Титул2</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул1</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул2</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул3</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул4</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул5</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул6</name>
  </enumValues>
  <enumValues>
    <name>ДФ_Титул1</name>
  </enumValues>
  <enumValues>
    <name>ДФ_Титул2</name>
  </enumValues>
  <enumValues>
    <name>ЭкспедиторскаяРасписка</name>
  </enumValues>
  <enumValues>
    <name>СкладскаяРасписка</name>
  </enumValues>
  <enumValues>
    <name>ПЭ_ЗаявкаНаМаршрут</name>
  </enumValues>
  <enumValues>
    <name>ПЭ_Титул1</name>
    <comment>Поручение экспедитору (ПЭ). Титул1 (ON_POREXPKLT)</comment>
  </enumValues>
  <enumValues>
    <name>ПЭ_Титул2</name>
    <comment>Поручение экспедитору (ПЭ). Титул2 (подтверждение)</comment>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул1_5_02</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул2_5_02</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул3_5_02</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул4_5_02</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул5_5_02</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_СценарииРедактированияШаблона/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Функция Сериализовать(Значение, ТипЛогистическогоДокумента) Экспорт
	
	Если Значение = НеРедактируется Тогда
		Результат = "";
	ИначеЕсли Значение = ДоступныВсеПоля Тогда	
		Если ТипЛогистическогоДокумента = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЭ_Титул1 Тогда	 
			Результат = "AD33FF8A-FD30-4D15-A334-065AE3E2CA62";
		ИначеЕсли ТипЛогистическогоДокумента = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЗЗ_Титул1 Тогда
			Результат = "8AAFF7BA-FD5E-4346-B615-B1F96455968B";
		Иначе 
			Результат = "";
		КонецЕсли;
	Иначе 
		Результат = "";					
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Преобразует EditingSettingId из Диадок в значение перечисления.
// Пустой идентификатор означает сценарий «Для подписания (не редактируется)».
//
// Параметры:
//  Значение - Строка - GUID EditingSettingId
//  ТипЛогистическогоДокумента - ПеречислениеСсылка.КонтурЛогистика_ТипыЛогистическихДокументов - необязательный
//
// Возвращаемое значение:
//  ПеречислениеСсылка.КонтурЛогистика_СценарииРедактированияШаблона
//
Функция Десериализовать(Значение, ТипЛогистическогоДокумента = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(Значение) Тогда
		Возврат НеРедактируется;
	КонецЕсли;
	
	Идентификатор = ВРег(СокрЛП(Значение));
	ИдентификаторыДоступноВсе = ИдентификаторыДоступныВсеПоля();
	
	Если ИдентификаторыДоступноВсе.Найти(Идентификатор) <> Неопределено Тогда
		Возврат ДоступныВсеПоля;
	КонецЕсли;
	
	Возврат НеРедактируется;
	
КонецФункции

Функция ИдентификаторыДоступныВсеПоля()
	
	Идентификаторы = Новый Массив;
	Идентификаторы.Добавить("AD33FF8A-FD30-4D15-A334-065AE3E2CA62");
	Идентификаторы.Добавить("8AAFF7BA-FD5E-4346-B615-B1F96455968B");
	
	Возврат Идентификаторы;
	
КонецФункции

// Возвращает описание настройки «Тип шаблона для отправки контрагенту» по значению сценария.
//
// Параметры:
//  СценарийРедактированияШаблона - ПеречислениеСсылка.КонтурЛогистика_СценарииРедактированияШаблона
//
// Возвращаемое значение:
//  Строка
//
Функция ОписаниеДляНастройки(СценарийРедактированияШаблона) Экспорт
	
	Если СценарийРедактированияШаблона = ДоступныВсеПоля Тогда
		
		Возврат
			"Шаблон для редактирования.
			|Документ, созданный из данного шаблона, контрагент сможет отредактировать - внести дополнения по грузу, адресам или иным данным.";
		
	ИначеЕсли СценарийРедактированияШаблона = НеРедактируется Тогда
		
		Возврат
			"Шаблон для подписания.
			|Документ, созданный из данного шаблона, контрагент сможет только подписать и отправить. Внести изменения в документ нельзя.";
		
	КонецЕсли;
	
	Возврат "";
	
КонецФункции


#КонецЕсли
